Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: The Worker
ja: ワーカー

source: could be fatal to certification.)
ja: 認定を阻む可能性があります。)

source: A Glimpse).
ja: 「紹介」という語を使用しています。

source: From Source to Image
ja: ソースからイメージに

source: MeeGo Wiki http://wiki.meego.com/Main_Page Developers Resources http://meego.com/developers Mailing Lists http://meego.com/community/mailing-lists
ja: MeeGo Wiki http://wiki.meego.com/Main_Page 開発者用リソース http://meego.com/developers メーリング リスト http://meego.com/community/mailing-lists

source: As a trusted, neutral, non-commercial source of expertise, advice, and assistance, the Linux Foundation will help organizations achieve their compliance objectives, a sometimes daunting task.
ja: The Linux Foundation (LF) が、信頼できる中立な非営利機関として、専門知識、アドバイス、および支援を提供し、組織にとって時に困難な課題となるコンプライアンスの履行を助けます。

source: Figure 8.
ja: 図 8

source: Identification Phase
ja: 識別フェーズ

source: - Identify changes to a bill of material between two releases of the same product
ja: 同じ製品の 2 つのリリース間の BoM の差異を識別する

source: It is worth mentioning that there exist in the market several commercial and open source tools that provide the various functionalities described below.
ja: 市場には、次のようなさまざまな機能を持つ商用ツールやオープン ソース ツールが存在します。

source: These numbers are steadily increasing as new developers join the project, more projects and packages are added and additional target platforms are supported.
ja: 新しい開発者がプロジェクトに参加し、プロジェクトやパッケージが追加され、ターゲットのプラットフォームが増えるにつれて、この数は確実に増加しています。

source: Final Verifications Phase
ja: 最終確認フェーズ

source: Repeatable and reproducible, while intrinsically different, are complementary.
ja: 反復可能と再生可能は、本質的には異なりますが、補完し合うものです。

source: The analysis is run
ja: 解析が実行される

source: Version 1.0 beta is a terrific starting point, but just that.
ja: バージョン 1.0 のベータ版は、開始点にすぎません。

source: Repository
ja: リポジトリ

source: Initiated by the Linux Foundation as an open source project, the tool will be capable of reporting differences between BoMs and therefore enabling companies to identify changed source code components and to better report included open source component in updated product releases.
ja: The Linux Foundation がオープン ソース プロジェクトとして開発したこのツールは、ソフトウェアのバージョン間での BoM（構成表）の差分をチェックします。企業は、差分のソース コード コンポーネントだけを確認すればよいため、アップデート製品リリースに含まれるオープン ソース コンポーネントの報告が容易になります。

source: Which version of the SPDX(TM) specification is in use
ja: 使用している SPDX(TM) 仕様書のバージョン

source: Unique identifiers for common open source licenses
ja: 共通のオープン ソース ライセンスに対応する一意の識別子

source: Once you upload the FOSS packages to the distribution web site, there are verification steps to validate that the package has been uploaded correctly, and can be downloaded and uncompressed on an external computer without errors (Figure 13).
ja: FOSS パッケージを配布用 Web サイトにアップロードしたら、それが正常にアップロードされていること、エラーなく外部コンピューターにダウンロードでき、解凍できることを確認します (図 13)。

source: Project Management
ja: プロジェクト管理

source: Automation / Tool Support
ja: 自動化 / ツール サポート

source: There has to be a company executive who is the compliance champion that ensures corporate support for the compliance function.
ja: 企業によるコンプライアンス徹底の支援を保証するコンプライアンス チャンピオンとなるべきエグゼクティブが存在するはずです。

source: Example of an attribution notice (for Webkit1):
ja: 帰属告知の例 (Webkit1 の場合):

source: Please send comments to compliance@linuxfoundation.org.
ja: 宛先は compliance@linuxfoundation.org (英語) です。

source: Utilize tools and automation to support efficient processing of compliance tickets
ja: コンプライアンス チケットの効率的な処理を助けるツールと自動化を有効利用する

source: ≫ The Open Compliance Program
ja: オープン コンプライアンス プログラム

source: Linux distributions in general use the GNU toolchain provided by the Free Software Foundation (FSF) but other tools may be used or required dependent on what the project is.
ja: Linux ディストリビューションは、一般的に Free Software Foundation (FSF) が提供している GNU ツールチェーンを使用しますが、プロジェクトによっては、その他のツールが使用される場合や、必要な場合があります。

source: Linux.com (see the embedded Linux section)
ja: Linux.com (組込み Linux のセクションを参照)

source: Other obligations may also apply.
ja: その他の義務も適用される場合があります。

source: Such a scheme is fully consonant with the current draft version of the Windows 8 UEFI logo requirements.
ja: この方法は、最新ドラフト バージョンの Windows 8 UEFI ロゴ要件を完全に満たします。

source: MeeGo Project http://www.meego.com and http://www.meego.com/about
ja: MeeGo プロジェクト http://www.meego.com and http://www.meego.com/about

source: e)Compliance projects are planned and scheduled, progress is tracked, and issues are escalated as needed.
ja: コンプライアンス プロジェクトが計画およびスケジューリングされ、進捗が追跡され、必要に応じて問題が報告されている。

source: Once the OSRB approves the usage of a FOSS component, the OSRB communicates to the product teams about the approval so they understand their responsibilities and start their preparations to fulfill the license obligations.
ja: OSRB は、FOSS コンポーネントの使用を承認すると、承認内容について製品担当チームに説明します。これにより、製品担当チームは彼らの責任を理解し、ライセンス義務を履行する準備を開始します。

source: Since the file is not added to the FOSSology file repository or the database, the results of this analysis are not available to other local users.
ja: このファイルは FOSSology ファイル リポジトリやデータベースに追加されないため、他のローカル ユーザーは、この解析結果を参照できません。

source: Rebuilds if applicable
ja: 適用可能な場合はリビルド

source: This mode of operation runs counter to the UEFI recommendation that the platform owner be the PK controller and would ensure that the Windows operating system would then become the only bootable operating system on the platform, but we must agree that it is a legitimate choice for an informed user to make voluntarily.
ja: この方法は、プラットフォーム オーナーがプラットフォーム鍵の管理者であるという UEFI の勧告に反し、Windows OS だけをそのプラットフォームでブート可能な OS にします。とはいえ、ユーザーが任意の上であれば問題はありません。

source: - Full platform scan
ja: フル プラットフォーム スキャン

source: Throughout the paper, we looked at what happens in these various phases, identified the inputs and outputs of each phase and how to keep tight control on software usage via the compliance process.
ja: また、この各フェーズで何が行われるか、各フェーズの入力と出力は何か、さらに、ソフトウェアの使用に関する厳格な管理をコンプライアンス プロセスによってどのように維持するか、について見てきました。

source: The build capacity of an OBS deployment scales with the number of its workers.
ja: OBS デプロイメントのビルド容量は、そのワーカーの数によって異なります。

source: We therefore propose that all the interested parties establish a Certificate Authority whose key should be placed in the UEFI firmware table by default; this authority would become responsible for handing out signed KEKs to UEFI device vendors (for their UEFI drivers), UEFI OEM platform vendors (for their firmware images) and OS vendors (for securely booting their OSs).
ja: このような背景から、すべての関連組織が認証局を設置し、既定で認証局の鍵を UEFI ファームウェア テーブルに置いておくよう提案します。認証局は、署名された鍵交換鍵を UEFI デバイス ベンダー (UEFI ドライバーのため) 、UEFI OEM プラットフォーム ベンダー (ファームウェア イメージのため)、および OS ベンダー (OS を安全にブートするため) に渡す責任を持ちます。

source: Not every organization will see a need to implement every practice and some will find alternative practices or implementation approaches that achieve the goals of a compliance program.
ja: すべての組織がすべてのプラクティスを実行する必要はないでしょう。また、異なるプラクティスや実行方法でコンプライアンス プログラムの目的を達成する組織もあるでしょう。

source: c)An individual or team is designated as the organization's point of contact to the external OSS community for compliance-related communications.
ja: c) 社外の OSS コミュニティと、コンプライアンス関連のコミュニケーションをとるために、組織の連絡先窓口として、個人またはチームが指定されている。

source: i)Tool requirements are documented.
ja: i) ツール要件が文書化されている。

source: Tools and Automation
ja: ツールと自動化

source: Because most software products developed today are composed of mixed code acquired from many different sources - in many cases, without the knowledge of product and development managers and executives - the software supply chain has become more complex.
ja: プロダクト マネージャー、開発マネージャー、上級管理者層などが把握することなく、開発されているソフトウェア製品に、さまざまな開発元を持つコードが混在し、ソフトウェアのサプライ チェーンが複雑化しているのです。

source: The first half of this paper discusses the elements of a successful compliance program that allows companies to capture, govern, and track all FOSS components included in their commercial products.
ja: この文書の前半では、企業が自社製品に含まれるすべての FOSS コンポーネントを把握、管理、および追跡できるような、成功するコンプライアンス プログラムの要素について説明します。

source: Android Bootcamp
ja: Android Bootcamp (Android ブートキャンプ)

source: These demonstation buckets are the only ones that come preinstalled with FOSSology.
ja: FOSSology にプリインストールされているデモ バケットは、これだけです。◆

source: The source code of the component in question is uploaded to the web site for distribution (if that was the distribution method of choice).
ja: 対象のコンポーネントのソース コードが、配布用の Web サイトにアップロードされる (配布メソッドが Web サイトである場合)。

source: - Create the final audit report and ensure that all identified issues have been closed
ja: - 最終的な監査報告を作成し、検出されたすべての問題がクローズしたことを確認する

source: Migration at a later point in time is always possible but typically more disruptive.
ja: 後からいつでも導入できるとはいえ、遅くなるほど難しい作業になるでしょう。

source: Fortunately a new working group is tackling one of the toughest obstacles to sharing information about software packages - collaborating on discovering and sharing information about software packages and their related content, including licenses.
ja: 幸い、新しいワーキング グループが、ソフトウェア パッケージの情報共有に関する最も難しい問題の 1 つに取り組み始めました。すなわち、「ソフトウェア パッケージとその関連コンテンツ (ライセンスなど) に関する情報の検出と共有」のための協力です。

source: In the following sections, we will provide a brief overview of each of these essential elements in a FOSS compliance program.
ja: 次のセクションでは、FOSS コンプライアンス プログラムにおけるこれらの各基本要素の概要を簡単に説明します。

source: Therefore, you should expect to build your compliance infrastructure as you go and keeping in mind its scalability for future activities and products.
ja: したがって、まず必要な部分から徐々にコンプライアンス基盤を固めるようにし、今後の活動や製品に対応できるよう拡張性を持たせておくとよいでしょう。

source: Open Compliance Program:
ja: オープン コンプライアンス プログラム:

source: More information can be found at
ja: 詳細については、下記のページをご覧ください。

source: As a result, the FOSS component cannot be used in the product, though the requester can consider submitting a rebuttal for reconsideration by the OSRB.
ja: 申請者は、OSRB に再考を促す反論書を提出することは可能ですが、最終的に承認されなかった FOSS コンポーネントを製品で利用することはできません。

source: Free and Open Source Software Compliance:
ja: フリー & オープン ソース ソフトウェア コンプライアンス:

source: For most software components, the approval is granted by the OSRB given that the ticket has made it that far in the compliance process.
ja: 通常のソフトウェア コンポーネントは、ここまでコンプライアンス プロセスのチケットが進めば、OSRB による承認が受けられます。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from the FOSS components to the proprietary components.
ja: アーキテクチャ レビューの結果は、FOSS コンポーネントからプロプライエタリ コンポーネントに拡張する可能性のあるライセンス義務を解析することです。

source: Following this method, failure to abide by the compliance policies will affect directly the employee's bonus reward; as a result, engineers will have additional incentives to ensure compliance.
ja: この方法では、コンプライアンス ポリシーに違反した場合は、従業員のボーナスに直接影響が出る。つまり、技術者がコンプライアンスを順守するようインセンティブを与える。

source: Making available:
ja: 利用可能にする:

source: b)A process improvement plan is established for the compliance process.
ja: コンプライアンス プロセスに対するプロセス改善計画が確立されている。

source: The Compliance Officer drives the design reviews and invites different engineering participants depending on the software component in question.
ja: コンプライアンス オフィサーは設計レビューを推進し、対象となるソフトウェア コンポーネントのタイプに応じて、最適なエンジニアリング担当者に協力を求めます。

source: Think of this as “institutionalizing” a practice, in other words becoming “the way you do business.”
ja: つまり、プラクティスを「実行可能なものとして整備」して、「自社流」にしてください。

source: Proprietary
ja: プロプライエタリ

source: The result of compliance due diligence is an identification of all free and open source software (FOSS) used in a product intended for external distribution and a plan to meet the attendant license obligations.
ja: コンプライアンス精査の結果、外部に配布する製品で使用されるすべての FOSS、およびそれに付随するライセンス義務の履行プランが特定されます。

source: For FOSS components, this includes COPYING, README, or LICENSE files.
ja: FOSS コンポーネントの場合には、COPYING、README、または LICENSE ファイルを提供します。

source: Version 1 of the SPDX(TM) standard provides a format for representing facts first identifying the package, then about the package content, and finally about the files composing the package.
ja: SPDX(TM) 標準規格のバージョン 1 では、まずパッケージを識別するための区分のフォーマットを、続いて、パッケージの内容を表すための区分のフォーマットを、そして最後にパッケージを構成するファイルについて説明する区分のフォーマットを提供します。

source: Therefore, it is recommended to ensure compliance prior to product ship.
ja: したがって、製品出荷前に必ずコンプライアンスを確認してください。

source: The result of compliance due diligence is an identification of all FOSS used in the product and a plan to meet the FOSS license obligations.
ja: コンプライアンス精査の結果、製品で使用されるすべての FOSS と、その FOSS のライセンス義務を履行するプランが特定されます。

source: For more information: Download the Code Janitor Tool Overview
ja: 詳細情報: Download the Code Janitor Tool Overview

source: Learn more about our Training and Education programs.
ja: トレーニングや教育プログラムの詳細

source: The uploaded compressed file (mythtv-0.23.1.tar.bz2) is unpacked down to its component files and saved in the FOSSology file repository
ja: アップロードされた圧縮ファイル (mythtv-0.23.1.tar.bz2) が解凍され、コンポーネント ファイルとなり、FOSSology ファイル リポジトリに保存される

source: a) The organization investigates the third party supplier's compliance and supply chain management practices to evaluate their adequacy.
ja: a) 組織は、サードパーティ サプライヤーのコンプライアンスおよびサプライ チェーン管理プラクティスを調査し、サードパーティの妥当性を評価する。

source: http://www.linuxfoundation.org/programs/legal/compliance/training-and-education
ja: http://www.linuxfoundation.jp/programs/legal/compliance/training-and-education

source: a)The organization tracks progress of the OSS discovery process and of scans and audits on the product's code.
ja: a) 組織は、OSS 検出プロセスおよび製品コードスキャンと監査の進捗を追跡する。

source: There should also be a mechanism (very similar to the current Trusted Platform Module reset operation) to allow a platform to be reset back to setup mode for the case where the owner wishes to resell it or has lost control of the PK.
ja: また、オーナーがその PC を再販したい場合や、プラットフォーム鍵を管理できなくなった場合に備えて、プラットフォームを setup モードに戻すメカニズムも必要です。これは現行の Trusted Platform Module（TPM）に良く似たメカニズムです。

source: Messaging, internally within your organization and externally towards the FOSS community
ja: メッセージング。社内には内部的に、FOSS コミュニティに対しては外部的に

source: b) The organization uses defined guidelines to determine if automated scanning or other confirmation of the supplier's disclosure is needed.
ja: b) 組織は、定義されたガイドラインを使用して、サプライヤーの開示に関して、追加的な自動スキャニングやその他の確認が必要かどうかを決定する。

source: Additional Resources
ja: その他の資料

source: Through this mechanism the scheduler takes care that all repositories and projects remain in a consistent state at all times.
ja: スケジューラーは、このメカニズムを利用して、すべてのリポジトリとプロジェクトを常に一貫した状態に保ちます。

source: Better corporate readiness in preparation for possible acquisition, sale, new product or service release, where compliance assurance is mandatory before the completion of any of these transactions.
ja: 事前のコンプライアンス保証を必要とする買収、売却、新製品やサービスのリリースなどに備えることができる

source: However, a major deviation ?
ja: しかし、大きな偏差は、

source: Each host is running 12 workers.
ja: また、各ホストでは、12 個のワーカーが機能しています。

source: Informal Training
ja: 非公式のトレーニング

source: The reasoning behind these recommendations is summarized below.
ja: 以上を推奨する理由について、これから説明します。

source: Rectify
ja: 修正

source: Once the OSRB has approved the usage of FOSS in a product, as part of the approval process, the OSRB compiles the list of obligations and passes it to the various other individuals and teams to ensure its fulfillment.
ja: OSRB は、製品への FOSS 利用を承認する際、その承認プロセスの中で義務リストを編集し、各担当者やチームに渡して、確実に義務が実行されるようにします。

source: Hosting brown-bag FOSS and compliance seminars are a successful way to bring additional compliance awareness.
ja: ブラウンバッグ FOSS & コンプライアンス セミナー: さらにコンプライアンスへの認識が高まる。

source: It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL?only the original English text of the GNU GPL does that.
ja: It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL?only the original English text of the GNU GPL does that. (これは Free Software Foundation によって発行されたものではありません。また、GNU GPL を使用するソフトウェアの配布条件を法的に述べているわけではありません。正式にこれを述べている文書は、GNU GPL の英語の原文だけです。)

source: LF281 Executive Review of Open Source Compliance.
ja: LF281 オープン ソース コンプライアンスのエグゼクティブ レビュー

source: - Component has been approved for usage
ja: コンポーネントの使用が承認されている

source: - Common mistakes and how to avoid them
ja: よくある失敗とその回避方法

source: There are different types of reviews that occur as part of a compliance process.
ja: コンプライアンス プロセスの一環として、各種のレビューが行われます。

source: The OSRB updates end-user documentation to ensure appropriate notices are provided to consumers about FOSS included in the product along with a written offer on how to obtain the source code when applicable.
ja: OSRB は、エンドユーザー ドキュメントを更新し、消費者に対して、製品に含まれる FOSS に関しての適切な告知が行われており、ソース コードの取得方法についての書面によるオファーが適宜提供されていることを確認します。

source: Compliance Process Management focuses on establishing, maintaining, and improving a process capability to achieve OSS compliance.
ja: 「コンプライアンス プロセス管理」は、OSS コンプライアンスを履行するためのプロセス機能の確立、保守、および改善に焦点を当てます。

source: Once notified by the dispatcher a worker accesses the source server to retrieve the source files for a project or package and the binaries it depends on from the repository server.
ja: ディスパッチャーに通知されたワーカーは、ソース サーバーにアクセスし、プロジェクトやパッケージ、およびそれが依存するバイナリに対応するソース ファイルをリポジトリ サーバーから取得します。◆

source: Plan a complete compliance infrastructure to meet your long-term goals, and then implement the pieces needed for short-term execution.
ja: 長期的な目標を満たす完全なコンプライアンス基盤を計画し、それから短期的な実行に必要な項目を実装する。

source: Distributed Build Service
ja: 分散ビルド サービス

source: A best practice in this area is to mandate third party software providers to disclose (through a source code scan report) FOSS used in their offering along with a statement on how they plan to meet the applicable FOSS license obligations.
ja: 最も効果的な方法は、サード パーティのソフトウェア提供者に対し、そのソフトウェアで使用している FOSS を (ソース コード スキャン レポートを使用して) 公開させるとともに、適用される FOSS ライセンス義務をどのように順守する予定であるか提示させることです。

source: OSS Inventory / Recordkeeping addresses the organization's need to maintain accurate records of OSS content and OSS compliance activities to support responses to compliance inquiries and changes in the compliance environment.
ja: 「OSS インベントリ / 記録管理」は、組織のニーズに沿って、OSS コンテンツと OSS コンプライアンス作業の正確な記録を保持することにより、コンプライアンス照会に対する応答や、コンプライアンス環境の変化に対応します。

source: With the conventional analysis method, the file to analyze can be an archive file (even an entire disk image) or a single source code file.
ja: 通常解析では、アーカイブ ファイルでも (ディスク イメージでも可)、1 ソース コード ファイルでも解析できます。

source: Embedded development tools should be very familiar.
ja: 組込み開発ツールを熟知する必要があります。

source: Source code reviews are used during the development phase to assure that OSS packages contain necessary and appropriate documentation of copyright, attribution, licensing, and change log information.
ja: ソース コード調査プロセスを開発段階で実行し、著作権、帰属、ライセンス、変更記録情報などの必要不可欠かつ適切な文書が OSS パッケージに含まれるよう保証する。

source: These failures can be discovered by:
ja: このような違反を発見する方法:

source: Other Open Source Compliance Tools
ja: その他のオープン ソース コンプライアンス ツール

source: a)The organization reviews records of OSS internal use periodically to identify opportunities to save money, improve performance, and achieve operational synergies.
ja: a) 組織は、OSS の社内利用の記録を定期的に調査し、コスト削減、パフォーマンス向上、および運用シナジー達成のチャンスを見極める。

source: Third party suppliers disclose all OSS in their deliverables.
ja: サード パーティ サプライヤーは、提供品に含まれているすべての OSS を開示する。

source: The Legal representative must approve the usage of a FOSS after reviewing the compliance ticket and evaluating the risk factors based on the feedback provided by engineering and the compliance officer.
ja: 法律顧問は、コンプライアンス チケットを受領し、エンジニアリング チームやコンプライアンス オフィサーからのフィードバックをもとに危険因子を評価して、FOSS の使用承認を決定します。

source: FOSS compliance is an essential part of the software development process.
ja: FOSS コンプライアンスは、ソフトウェア開発プロセスの重要な要素です。

source: TABLE 1.
ja: 表 1.

source: Company policies regarding merger and acquisition transactions need to be updated to account for FOSS.
ja: 合併や買収などの取引に関わる企業ポリシーには、FOSS 関する最新の情報が含まれている必要があります。

source: Obviously, a closed operating system could be booted identically to an open one above and still retain all its secure features, since security is guaranteed by control of the KEK which would remain in the hands of the operating system vendor.
ja: 当然ですが、クローズド OS もオープン OS と全く同じようにブートし、かつセキュアな機能を保持することができます。なぜなら、ここにおけるセキュリティは、OS ベンダーによって管理された鍵交換鍵の制御によって保証されているからです。

source: Instructor-led live remote training will also be available.
ja: インストラクターによるライブ リモート トレーニングも可能です。

source: A Close Look at a Sample End-to-End Compliance Process
ja: 詳細なコンプライアンス プロセス例の考察◆◆

source: A complete and operational Linux distribution consists of at least a couple of hundreds if not thousands of packages that are laid out in a particular fashion in one or more file systems.
ja: 完成した使用可能な Linux ディストリビューションは、1 つ以上のファイル システムの形式に対応する数百以上のパッケージで構成されています。◆

source: Training and Education
ja: トレーニングと教育

source: The ultimate goal of a build system is to improve product quality by acceleration of the build process, elimination of redundant tasks, reducing dependency on key personnel all of which essentially leads to savings of time and money.
ja: ビルド システムの最終目的は、ビルド プロセスを加速し、冗長な作業を排除し、主要人員への依存度を低減することにより、製品の品質を向上させることであり、これらのすべてが本質的に時間とお金の節約につながります。

source: It includes a formal process for the approval, acquisition, and use of FOSS, and a method for releasing software containing FOSS or licensed under a FOSS license.
ja: たとえば、FOSS の承認、入手、および使用のための正式なプロセス、FOSS を含むソフトウェアや FOSS ライセンスの下でライセンスされたソフトウェアをリリースする方法などが含まれます。

source: Obviously, workers can be deployed on multiple different physical systems.
ja: ワーカーは、複数の異なる物理システムにデプロイできます。

source: In using the Self-Assessment Checklist, organizations can apply a similar line of analysis to determine whether an effective open compliance program has been established.
ja: 自己診断チェックリストを使用する際、組織は同様の分析を適用し、効果的なオープン コンプライアンス プログラムが確立されているかどうかを判断できます。

source: The FOSSBazaar website can be found at http://fossbazaar.org.
ja: FOSSBazaar の Web サイトは、http://fossbazaar.org です。

source: Training addresses the communications needed to assure that the entire company understands what must be done to achieve OSS compliance.
ja: 「トレーニング」は、OSS コンプライアンスを履行するために行うべきことを、企業全体が確実に理解するために必要な活動を行います。

source: Mission
ja: ミッション

source: To learn more about The Linux Foundation, and our other initiatives please visit us at http://www.linuxfoundation.org/.
ja: The Linux Foundation およびその他の活動については、http://www.linuxfoundation.org/ を参照してください。

source: Informal compliance inquiries can include requests such as:
ja: 非公式なコンプライアンス照会として、次のようなものが考えられます。

source: The organization engages in externally-focused benchmarking activities to identify potential improvements to its compliance process.
ja: 組織は、コンプライアンス プロセスに対する改善の可能性を見出すために、社外にフォーカスしたベンチマーキング活動に携わっていること。

source: The organization periodically conducts audits of OSS use.
ja: 組織は定期的に OSS 利用の監査を実施する。

source: About MeeGo
ja: MeeGo について

source: As a refresher, the process illustrated in Figure 1 includes the various steps a software component goes through before it is approved for inclusion in a product software stack.
ja: そこでの説明の繰り返しになりますが、図 1 は、あるソフトウェア コンポーネントを自社製品のソフトウェア スタックに組み込む際の承認手続きを示しています。

source: (The core processes are presented first, top to bottom, then the supporting elements, top to bottom.)
ja: (まず、コア プロセスが上から順に、続いてサポート項目が上から順に現れます。)

source: Figure 1.
ja: 図 1

source: In using the Self-Assessment Checklist, organizations can apply a similar line of analysis to determine whether an effective open compliance program has been established,
ja: 自己診断チェックリストを使用する際も、組織は同様の分析を適用し、効果的なオープン コンプライアンス プログラムが確立されているかどうかを判断します。

source: The community provides such companies with source code, technical support, testing, and documentation.
ja: コミュニティはそのような企業に対し、ソース コード、技術サポート、テスト、およびドキュメントを提供します。

source: The OSRB Legal representative works with OSEC to review and approve the release of software under FOSS terms or the release of proprietary source code as FOSS.
ja: OSRB の法律顧問は、OSEC と協力し、FOSS の条件下でソフトウェアをリリースすること、あるいは自社のソース コードを FOSS としてリリースすることを検討し、承認します。
